I confirm the import works. However I'm observing another problem: Terraform wants to replace the policy tag on the imported resource because it wants to "add" the taxonomy attribute:

```
 # module.common.google_data_catalog_policy_tag.advertising_id_cleartext must be replaced
-/+ resource "google_data_catalog_policy_tag" "advertising_id_cleartext" {
      ~ child_policy_tags = [] -> (known after apply)
      ~ id                = "projects/my-project-id/locations/us/taxonomies/268635763456745357/policyTags/3829827535341454737" -> (known after apply)
      ~ name              = "projects/my-project-id/locations/us/taxonomies/268635763456745357/policyTags/3829827535341454737" -> (known after apply)
      + taxonomy          = "projects/my-project-id/locations/us/taxonomies/268635763456745357" # forces replacement

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

Adding the `lifecycle` block seems to be an effective workaround:
```tf
resource "google_data_catalog_policy_tag" "my_policy_tag" {
  provider     = google-beta
  taxonomy     = google_data_catalog_taxonomy.my_taxonomy.id
  display_name = "my_policy_tag"
  description  = "Whatever"

  lifecycle {
    // Workaround for bug: Terraform wants to replace the imported policy tag
    ignore_changes = [taxonomy]
  }
}
```